grevaillot/svd_tools/headers/STM32F7x7/dma1.h
/** DMA1_HISR_TCIF7 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA1_HISR_TCIF7		(1 << 27)
/** DMA1_HISR_HTIF7 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA1_HISR_HTIF7		(1 << 26)
/** DMA1_HISR_TEIF7 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA1_HISR_TEIF7		(1 << 25)
/** DMA1_HISR_DMEIF7 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA1_HISR_DMEIF7		(1 << 24)
/** DMA1_HISR_FEIF7 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA1_HISR_FEIF7		(1 << 22)
/** DMA1_HISR_TCIF6 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA1_HISR_TCIF6		(1 << 21)
/** DMA1_HISR_HTIF6 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA1_HISR_HTIF6		(1 << 20)
/** DMA1_HISR_TEIF6 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA1_HISR_TEIF6		(1 << 19)
/** DMA1_HISR_DMEIF6 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA1_HISR_DMEIF6		(1 << 18)
/** DMA1_HISR_FEIF6 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA1_HISR_FEIF6		(1 << 16)
/** DMA1_HISR_TCIF5 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA1_HISR_TCIF5		(1 << 11)
/** DMA1_HISR_HTIF5 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA1_HISR_HTIF5		(1 << 10)
/** DMA1_HISR_TEIF5 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA1_HISR_TEIF5		(1 << 9)
/** DMA1_HISR_DMEIF5 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA1_HISR_DMEIF5		(1 << 8)
/** DMA1_HISR_FEIF5 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA1_HISR_FEIF5		(1 << 6)
/** DMA1_HISR_TCIF4 Stream x transfer complete interrupt flag (x=7..4) **/
#define DMA1_HISR_TCIF4		(1 << 5)
/** DMA1_HISR_HTIF4 Stream x half transfer interrupt flag (x=7..4) **/
#define DMA1_HISR_HTIF4		(1 << 4)
/** DMA1_HISR_TEIF4 Stream x transfer error interrupt flag (x=7..4) **/
#define DMA1_HISR_TEIF4		(1 << 3)
/** DMA1_HISR_DMEIF4 Stream x direct mode error interrupt flag (x=7..4) **/
#define DMA1_HISR_DMEIF4		(1 << 2)
/** DMA1_HISR_FEIF4 Stream x FIFO error interrupt flag (x=7..4) **/
#define DMA1_HISR_FEIF4		(1 << 0)

/**@}*/

/** @defgroup dma1_lifcr LIFCR low interrupt flag clear register
@{*/

/** DMA1_LIFCR_CTCIF3 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTCIF3		(1 << 27)
/** DMA1_LIFCR_CHTIF3 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CHTIF3		(1 << 26)
/** DMA1_LIFCR_CTEIF3 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTEIF3		(1 << 25)
/** DMA1_LIFCR_CDMEIF3 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CDMEIF3		(1 << 24)
/** DMA1_LIFCR_CFEIF3 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CFEIF3		(1 << 22)
/** DMA1_LIFCR_CTCIF2 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTCIF2		(1 << 21)
/** DMA1_LIFCR_CHTIF2 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CHTIF2		(1 << 20)
/** DMA1_LIFCR_CTEIF2 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTEIF2		(1 << 19)
/** DMA1_LIFCR_CDMEIF2 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CDMEIF2		(1 << 18)
/** DMA1_LIFCR_CFEIF2 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CFEIF2		(1 << 16)
/** DMA1_LIFCR_CTCIF1 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTCIF1		(1 << 11)
/** DMA1_LIFCR_CHTIF1 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CHTIF1		(1 << 10)
/** DMA1_LIFCR_CTEIF1 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTEIF1		(1 << 9)
/** DMA1_LIFCR_CDMEIF1 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CDMEIF1		(1 << 8)
/** DMA1_LIFCR_CFEIF1 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CFEIF1		(1 << 6)
/** DMA1_LIFCR_CTCIF0 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTCIF0		(1 << 5)
/** DMA1_LIFCR_CHTIF0 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CHTIF0		(1 << 4)
/** DMA1_LIFCR_CTEIF0 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CTEIF0		(1 << 3)
/** DMA1_LIFCR_CDMEIF0 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CDMEIF0		(1 << 2)
/** DMA1_LIFCR_CFEIF0 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA1_LIFCR_CFEIF0		(1 << 0)

/**@}*/

/** @defgroup dma1_hifcr HIFCR high interrupt flag clear register
@{*/

/** DMA1_HIFCR_CTCIF7 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTCIF7		(1 << 27)
/** DMA1_HIFCR_CHTIF7 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CHTIF7		(1 << 26)
/** DMA1_HIFCR_CTEIF7 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTEIF7		(1 << 25)
/** DMA1_HIFCR_CDMEIF7 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CDMEIF7		(1 << 24)
/** DMA1_HIFCR_CFEIF7 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CFEIF7		(1 << 22)
/** DMA1_HIFCR_CTCIF6 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTCIF6		(1 << 21)
/** DMA1_HIFCR_CHTIF6 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CHTIF6		(1 << 20)
/** DMA1_HIFCR_CTEIF6 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTEIF6		(1 << 19)
/** DMA1_HIFCR_CDMEIF6 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CDMEIF6		(1 << 18)
/** DMA1_HIFCR_CFEIF6 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CFEIF6		(1 << 16)
/** DMA1_HIFCR_CTCIF5 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTCIF5		(1 << 11)
/** DMA1_HIFCR_CHTIF5 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CHTIF5		(1 << 10)
/** DMA1_HIFCR_CTEIF5 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTEIF5		(1 << 9)
/** DMA1_HIFCR_CDMEIF5 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CDMEIF5		(1 << 8)
/** DMA1_HIFCR_CFEIF5 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CFEIF5		(1 << 6)
/** DMA1_HIFCR_CTCIF4 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTCIF4		(1 << 5)
/** DMA1_HIFCR_CHTIF4 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CHTIF4		(1 << 4)
/** DMA1_HIFCR_CTEIF4 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CTEIF4		(1 << 3)
/** DMA1_HIFCR_CDMEIF4 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CDMEIF4		(1 << 2)
/** DMA1_HIFCR_CFEIF4 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA1_HIFCR_CFEIF4		(1 << 0)

/**@}*/

/** @defgroup dma1_s0cr S0CR stream x configuration register
@{*/


