grevaillot/svd_tools/headers/STM32F7x7/dma1.h
#define DMA1_S7CR_DIR_SHIFT		6
#define DMA1_S7CR_DIR_MASK		0x03
/** @defgroup dma1_s7cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA1_S7CR_PFCTRL Peripheral flow controller **/
#define DMA1_S7CR_PFCTRL		(1 << 5)
/** DMA1_S7CR_TCIE Transfer complete interrupt enable **/
#define DMA1_S7CR_TCIE		(1 << 4)
/** DMA1_S7CR_HTIE Half transfer interrupt enable **/
#define DMA1_S7CR_HTIE		(1 << 3)
/** DMA1_S7CR_TEIE Transfer error interrupt enable **/
#define DMA1_S7CR_TEIE		(1 << 2)
/** DMA1_S7CR_DMEIE Direct mode error interrupt enable **/
#define DMA1_S7CR_DMEIE		(1 << 1)
/** DMA1_S7CR_EN Stream enable / flag stream ready when read low **/
#define DMA1_S7CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma1_s7ndtr S7NDTR stream x number of data register
@{*/


#define DMA1_S7NDTR_NDT_SHIFT		0
#define DMA1_S7NDTR_NDT_MASK		0xffff
/** @defgroup dma1_s7ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7par S7PAR stream x peripheral address register
@{*/


#define DMA1_S7PAR_PA_SHIFT		0
#define DMA1_S7PAR_PA_MASK		0xffffffff
/** @defgroup dma1_s7par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7m0ar S7M0AR stream x memory 0 address register
@{*/


#define DMA1_S7M0AR_M0A_SHIFT		0
#define DMA1_S7M0AR_M0A_MASK		0xffffffff
/** @defgroup dma1_s7m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7m1ar S7M1AR stream x memory 1 address register
@{*/


#define DMA1_S7M1AR_M1A_SHIFT		0
#define DMA1_S7M1AR_M1A_MASK		0xffffffff
/** @defgroup dma1_s7m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7fcr S7FCR stream x FIFO control register
@{*/

/** DMA1_S7FCR_FEIE FIFO error interrupt enable **/
#define DMA1_S7FCR_FEIE		(1 << 7)

#define DMA1_S7FCR_FS_SHIFT		3
#define DMA1_S7FCR_FS_MASK		0x07
/** @defgroup dma1_s7fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA1_S7FCR_DMDIS Direct mode disable **/
#define DMA1_S7FCR_DMDIS		(1 << 2)

#define DMA1_S7FCR_FTH_SHIFT		0
#define DMA1_S7FCR_FTH_MASK		0x03
/** @defgroup dma1_s7fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/
